___

<img src='../devf-logo.jpg' />

# Pandas

In [1]:
import pandas as pd

# Groupby
El método groupby nos permite formar grupos de filas y utilizar funciones sobre estos datos.

In [2]:
import pandas as pd
# Creando dataframe
data = {'Compañia':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Persona':['Juan','Paco','Alex','Julio','Carlos','Sarahi'],
       'Venta':[200,120,340,124,243,350]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

  Compañia Persona  Venta
0     GOOG    Juan    200
1     GOOG    Paco    120
2     MSFT    Alex    340
3     MSFT   Julio    124
4       FB  Carlos    243
5       FB  Sarahi    350

**Ahora podemos utilizar el metodo .groupby() para agrupar filas según el nombre de su columna; se creará un nuevo tipo de objeto:**

In [18]:
df.groupby('Compañia')

Podemos guardar este objeto como una nueva variable

In [19]:
by_comp = df.groupby("Compañia")
by_comp.head()

  Compañia Persona  Venta
0     GOOG    Juan    200
1     GOOG    Paco    120
2     MSFT    Alex    340
3     MSFT   Julio    124
4       FB  Carlos    243
5       FB  Sarahi    350

Ahora podemos utilizar metodos sobre esta nueva composición de datos

In [20]:
by_comp.mean()

          Venta
Compañia
FB        296.5
GOOG      160.0
MSFT      232.0

In [21]:
df.groupby('Compañia').mean()

          Venta
Compañia
FB        296.5
GOOG      160.0
MSFT      232.0

In [22]:
by_comp.std()

               Venta
Compañia
FB         75.660426
GOOG       56.568542
MSFT      152.735065

In [23]:
by_comp.min()

         Persona  Venta
Compañia
FB        Carlos    243
GOOG        Juan    120
MSFT        Alex    124

In [24]:
by_comp.max()

         Persona  Venta
Compañia
FB        Sarahi    350
GOOG        Paco    200
MSFT       Julio    340

In [25]:
by_comp.count()

          Persona  Venta
Compañia
FB              2      2
GOOG            2      2
MSFT            2      2

In [26]:
by_comp.describe()

         Venta
         count   mean         std    min     25%    50%     75%    max
Compañia
FB         2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG       2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT       2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [27]:
by_comp.describe().transpose()

Compañia             FB        GOOG        MSFT
Venta count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [28]:
by_comp.describe().transpose()['GOOG']

Venta  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

# ¡Excelente trabajo!